updated/nested-json-object/src/test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <SendOutbound xmlns="http://yesser.gov.sa/NCS/CSIAgencyOutboundServices/version/0.1">
            <OutboundRec>
                <OutboundInfo>
                    <OutboundDocNo>29</OutboundDocNo>
                    <OutboundType>50</OutboundType>
                    <OutboundGDate>2021-01-11T12:23:53.746Z</OutboundGDate>
                    <OutboundHDate>1442/05/27</OutboundHDate>
                    <OutboundSubject>&#x639;&#x628;&#x62F; - &#x635;&#x627;&#x62F;&#x631; - 66666q6q6q6
                    </OutboundSubject>
                    <OutboundCategory>General</OutboundCategory>
                    <OutboundRemarks></OutboundRemarks>
                    <OutboundGDueDate xsi:nil="true"/>
                    <OutboundClassification>Original</OutboundClassification>
                </OutboundInfo>
                <RoutingInfo>
                    <From>284000</From>
                    <To>277000</To>
                    <SecrecyLevel>N</SecrecyLevel>
                    <Priority>N</Priority>
                    <DeliveryType>E</DeliveryType>
                    <SenderType>GOVT</SenderType>
                </RoutingInfo>
            </OutboundRec>
        </SendOutbound>
    </soapenv:Body>
</soapenv:Envelope>
        <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
    <SendOutbound xmlns="http://yesser.gov.sa/NCS/CSIAgencyOutboundServices/version/0.1">
        <OutboundRec>
            <OutboundInfo>
                <OutboundDocNo>29</OutboundDocNo>
                <OutboundType>50</OutboundType>
                <OutboundGDate>2021-01-11T12:24:11.640Z</OutboundGDate>
                <OutboundHDate>1442/05/27</OutboundHDate>
                <OutboundSubject>&#x639;&#x628;&#x62F; - &#x635;&#x627;&#x62F;&#x631; - 66666q6q6q6</OutboundSubject>
                <OutboundCategory>General</OutboundCategory>
                <OutboundRemarks></OutboundRemarks>
                <OutboundGDueDate xsi:nil="true"/>
                <OutboundClassification>Copy</OutboundClassification>
            </OutboundInfo>
            <RoutingInfo>
                <From>284000</From>
                <To>262000</To>
                <SecrecyLevel>N</SecrecyLevel>
                <Priority>N</Priority>
                <DeliveryType>E</DeliveryType>
                <SenderType>GOVT</SenderType>
            </RoutingInfo>
        </OutboundRec>
    </SendOutbound>
</soapenv:Body>
</soapenv:Envelope> - org.apache.axis.client.Call.invoke(Call.java:2762)
